INSERT INTO post_bar_partition(partition_name, partition_status) VALUES ("看电影sdf士大夫df",1),("追剧狂as电风扇d",1),("小说a2sssssssssdf2  士大夫3",1),("游戏asdfssssssssssssssss",1);

INSERT INTO partition_catalogue(partition_id, catalogue_name,catalogue_explain,catalogue_status)
VALUE (50,"香港电影","分区说明",1),(23,"内地电影","分区说明",1),(23,"欧美电影","分区说明",1),(33,"韩国电影","分区说明",1),(1,"日本电影","分区说明",1),(1,"台湾电影","分区说明",1),
  (23,"香港电视剧","分区说明",1),(51,"内地电视剧","分区说明",1),(43,"日本电视剧","分区说明",1),(44,"美剧","分区说明",1),(2,"韩国电视剧","分区说明",1),(2,"电视剧角色","分区说明",1),
  (43,"修真","分区说明",1),(41,"玄幻","分区说明",1),(3,"武侠","分区说明",1),(37,"仙侠","分区说明",1),(3,"科幻","分区说明",1),(3,"历史","分区说明",1),
  (12,"客户端网游","分区说明",1),(32,"桌游","分区说明",1),(23,"网页版游戏","分区说明",1),(48,"小游戏","分区说明",1),(4,"单机游戏","分区说明",1),(4,"电子竞技及选手","分区说明",1);


INSERT INTO partition_catalogue(partition_id, catalogue_name,catalogue_explain,catalogue_status)
VALUE (51,"香港电影aaaaaawwer23423422","分区说明",1),(51,"内地电影","分区说明",1),(5,"欧美电影","分区说明",1),(1,"韩国电影","分区说明",1),(1,"日本电影","分区说明",1),(1,"台湾电影","分区说明",1),
  (51,"香港电视剧","分区说明",1),(51,"内地电视剧","分区说明",1),(2,"日本电视剧","分区说明",1),(2,"美剧","分区说明",1),(2,"韩国电视剧","分区说明",1),(2,"电视剧角色","分区说明",1),
  (51,"修真","分区说明",1),(51,"玄幻","分区说明",1),(51,"武侠","分区说明",1),(8,"仙侠","分区说明",1),(10,"科幻","分区说明",1),(3,"历史","分区说明",1),
  (51,"客户端网游","分区说明",1),(51,"桌游","分区说明",1),(9,"网页版游戏","分区说明",1),(4,"小游戏","分区说明",1),(4,"单机游戏","分区说明",1),(4,"电子竞技及选手","分区说明",1);

INSERT INTO post_bar_info(catalogue_id, post_bar_name, post_bar_explain, post_bar_logo_url, user_id,post_count,user_count,create_time,post_bar_status)
VALUE
(1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
(1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
(1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
(2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
(2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
(1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1),
  (1,"大话西游吧","以大话西游为主题的电影以及游戏的讨论处","xxxx",1,1690054,320183,now(),1),
  (1,"僵尸先生吧","香港僵尸片巅峰巨作；《僵尸先生系列》","xxxx",1,1690054,320183,now(),1),
  (1,"澳门风云2","[澳门风云2]1月19日暖心上映","xxxx",1,1690054,320183,now(),1),
  (2,"战狼吧","《战狼》2015年吴京3D动作火线巨制动作大片","xxxx",1,1690054,320183,now(),1),
  (2,"熊出没之夺宝雄兵","本吧是熊迷们的聚集地","xxxx",1,1690054,320183,now(),1);

INSERT INTO post_info(post_bar_id, post_title, post_content, user_id)
VALUES
(1, "看了两遍才看懂大话西游的结局1", "1.结局那些同样的面孔，都是他们的转世
2.因为牛魔王当时烧了那座城，师徒四人只有用月光宝盒穿越才能逃走，于是师徒四人穿越到了未来，
见到了转世后的一些人，城楼上的那个是至尊宝转世，
那个骂孙悟空头发开叉的是菩提转世，所以孙悟空让他捅他三刀，以还了上辈子欠他的恩情。
3.而至尊宝在之前是被蓝洁瑛扮演的那个白晶晶师姐杀死的，死前他看见了自己的心脏，
知道了紫霞仙子在她的心里留下了一滴眼泪，至尊宝死后的灵魂和菩提等几个强盗道别，
然后向菩萨忏悔自己的一生，最后决定戴上紧箍咒变成孙悟空去救师父，但是此时的他还保留着至尊宝的记忆，
所以看紫霞仙子死后会痛不欲生，穿越后见到自己的转世会去附身帮他，并对他最爱的人说了“我爱你”，
完成了自己未了的心愿，安心踏上了取经之路。",10000),
(1, "看了两遍才看懂大话西游的结局2", "1.结局那些同样的面孔，都是他们的转世
2.因为牛魔王当时烧了那座城，师徒四人只有用月光宝盒穿越才能逃走，于是师徒四人穿越到了未来，
见到了转世后的一些人，城楼上的那个是至尊宝转世，
那个骂孙悟空头发开叉的是菩提转世，所以孙悟空让他捅他三刀，以还了上辈子欠他的恩情。
3.而至尊宝在之前是被蓝洁瑛扮演的那个白晶晶师姐杀死的，死前他看见了自己的心脏，
知道了紫霞仙子在她的心里留下了一滴眼泪，至尊宝死后的灵魂和菩提等几个强盗道别，
然后向菩萨忏悔自己的一生，最后决定戴上紧箍咒变成孙悟空去救师父，但是此时的他还保留着至尊宝的记忆，
所以看紫霞仙子死后会痛不欲生，穿越后见到自己的转世会去附身帮他，并对他最爱的人说了“我爱你”，
完成了自己未了的心愿，安心踏上了取经之路。",10001),
(1, "看了两遍才看懂大话西游的结局3", "1.结局那些同样的面孔，都是他们的转世
2.因为牛魔王当时烧了那座城，师徒四人只有用月光宝盒穿越才能逃走，于是师徒四人穿越到了未来，
见到了转世后的一些人，城楼上的那个是至尊宝转世，
那个骂孙悟空头发开叉的是菩提转世，所以孙悟空让他捅他三刀，以还了上辈子欠他的恩情。
3.而至尊宝在之前是被蓝洁瑛扮演的那个白晶晶师姐杀死的，死前他看见了自己的心脏，
知道了紫霞仙子在她的心里留下了一滴眼泪，至尊宝死后的灵魂和菩提等几个强盗道别，
然后向菩萨忏悔自己的一生，最后决定戴上紧箍咒变成孙悟空去救师父，但是此时的他还保留着至尊宝的记忆，
所以看紫霞仙子死后会痛不欲生，穿越后见到自己的转世会去附身帮他，并对他最爱的人说了“我爱你”，
完成了自己未了的心愿，安心踏上了取经之路。",10002),
(1, "看了两遍才看懂大话西游的结局4", "1.结局那些同样的面孔，都是他们的转世
2.因为牛魔王当时烧了那座城，师徒四人只有用月光宝盒穿越才能逃走，于是师徒四人穿越到了未来，
见到了转世后的一些人，城楼上的那个是至尊宝转世，
那个骂孙悟空头发开叉的是菩提转世，所以孙悟空让他捅他三刀，以还了上辈子欠他的恩情。
3.而至尊宝在之前是被蓝洁瑛扮演的那个白晶晶师姐杀死的，死前他看见了自己的心脏，
知道了紫霞仙子在她的心里留下了一滴眼泪，至尊宝死后的灵魂和菩提等几个强盗道别，
然后向菩萨忏悔自己的一生，最后决定戴上紧箍咒变成孙悟空去救师父，但是此时的他还保留着至尊宝的记忆，
所以看紫霞仙子死后会痛不欲生，穿越后见到自己的转世会去附身帮他，并对他最爱的人说了“我爱你”，
完成了自己未了的心愿，安心踏上了取经之路。",10003);

# 分割线
INSERT INTO post_info(post_bar_id, post_title, post_content, user_id, top_post, wonderful_post, audit, visit_count, post_status, create_time) VALUES
(2, "【吧务请进】香港电影吧吧务守则2.0", "这种事费力不讨好，还得罪人，但我觉得我有必要做，因为落在这么局面里，
不做点什么也没办法。最近我在给吧务换血，按照吧务出勤率来更替，长久不出现的，
不管跟我私交如何，都换下去了，有哪位吧友满足条件，可以在该贴下应征，
上了要有作为，一礼拜工作量不够随时换。下面入正文。港吧现在情况不好，
跟所有电影贴吧一样，都死在贴吧的神奇推送功能上。这个功能最厉害的就是
，通过app给你大量推送一堆旧帖，不一定是几十年前的，网友又没有看发帖
时间的习惯，也就看了直接回复挖坟，殊不知四五年时间，连作者可能都转
世渡劫去了，你在这巴巴跟谁唠呢？这不赖任何人，只怨神奇的贴吧系统，
自己玩死自己的功力无人能及。那么危机之秋，我们该做什么才能留住港吧
，起码样子好看一点？我给吧务们写了几条准则，不敢要求大家照做，
毕竟你们不是我下属，我们都是为港吧续命而已，那就当是我求求你们，算个求人告示
我在这给大家打躬作揖了。守则放在2楼，大家有哪条不满意或者需要补充的，直接在层
下留言。", 100010, 1, 1, 1, 10000, 1, NOW());

INSERT INTO nf_user(user_id, user_phone, user_email, user_name, user_img_url, user_pwd, status, admin_id, grade_id, vip_id, user_logon_time, user_coin, user_exp)
VALUES (100010, "13117888888", "2789009909@qq.com", "港片挺好看", "xxx", "123456", 1, 1, 1, 1, NOW(), 100, 100),
(10000, "13117888881", "2789009901@qq.com", "港片挺好看1", "xxx", "123456", 1, 1, 1, 1, NOW(), 100, 100),
(10001, "13117888882", "2789009902@qq.com", "港片挺好看2", "xxx", "123456", 1, 1, 1, 1, NOW(), 100, 100),
(10002, "13117888884", "2789009903@qq.com", "港片挺好看3", "xxx", "123456", 1, 1, 1, 1, NOW(), 100, 100),
(10003, "13117888885", "2789009904@qq.com", "港片挺好看4", "xxx", "123456", 1, 1, 1, 1, NOW(), 100, 100);

# 开始插入测试帖子显示的数据

-- 有三个用户
INSERT INTO nf_user(user_id,user_name) VALUES (10001,'我是A'),(10002,'我是B'),(10003,'我是C');
-- 假设10001发了帖子,并且帖子生成的编号是33333
INSERT INTO post_info(user_id,post_content) VALUES (10001, "我好帅啊");
-- 假设10003回复了10001,并且回帖的编号为9898989
INSERT INTO reply_post_info(user_id,reply_user_id,reply_post_id) VALUES (10003,10001,33333);
-- 假设10002看见了10001发的帖子并且觉得10003的发言很有趣，然后100002回复了100003
INSERT INTO reply_info(user_id,reply_user_id,reply_post_id) VALUES (10002,10003,9898989);
-- 并且10002还给楼主回复了，那他这个就是回帖而不是回复
INSERT INTO reply_post_info(user_id,reply_user_id,reply_post_id) VALUES (10002,10001,33333);



# ```mysql
#账号
insert into nf_user( user_phone, user_email, user_name, user_img_url, user_pwd, status, admin_id, grade_id, vip_id, user_coin, user_exp) values ('123456789','123456788@qq.com','会飞的鱼'
,'xxxxxxxx','123456',1,123,2,4,99,190);
insert into nf_user( user_phone, user_email, user_name, user_img_url, user_pwd, status, admin_id, grade_id, vip_id, user_coin, user_exp) values ('123426789','123426788@qq.com','会飞的鸡'
 ,'xxxxxxxx','123456',1,123,2,4,99,190);
insert into nf_user( user_phone, user_email, user_name, user_img_url, user_pwd, status, admin_id, grade_id, vip_id, user_coin, user_exp) values ('234256789','234256788@qq.com','会飞的鸭'
 ,'xxxxxxxx','123456',1,123,2,4,99,190);
#帖子信息
insert into post_info( post_bar_id, post_title, post_content, user_id,  visit_count)
values (4,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
,'1',2000);
insert into post_info( post_bar_id, post_title, post_content, user_id,  visit_count)
values (4,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
       ,'1',2000);
insert into post_info( post_bar_id, post_title, post_content, user_id,  visit_count)
values (4,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
       ,'1',2000);
insert into post_info( post_bar_id, post_title, post_content, user_id,  visit_count)
values (4,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
       ,'1',2000);
insert into post_info( post_bar_id, post_title, post_content, user_id,  visit_count)
values (4,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
       ,'1',2000);
insert into post_info( post_bar_id, post_title, post_content, user_id,  visit_count)
values (4,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
       ,'1',2000);
insert into post_info( post_bar_id, post_title, post_content, user_id,  visit_count)
values (4,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
       ,'1',2000);
insert into post_info( post_bar_id, post_title, post_content, user_id,  visit_count)
values (4,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
       ,'1',2000);
insert into post_info( post_bar_id, post_title, post_content, user_id,  visit_count)
values (4,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
       ,'1',2000);
insert into post_info( post_bar_id, post_title, post_content, user_id,  visit_count)
values (4,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
       ,'1',2000);
#回帖信息
insert into reply_post_info(post_id, user_id, reply_post_content )
values (1,2,'表示赞同');
insert into reply_post_info(post_id, user_id, reply_post_content )
values (1,2,'表示赞同');
insert into reply_post_info(post_id, user_id, reply_post_content )
values (1,2,'表示赞同');
insert into reply_post_info(post_id, user_id, reply_post_content )
values (1,2,'表示赞同');
insert into reply_post_info(post_id, user_id, reply_post_content )
values (1,2,'表示赞同');
insert into reply_post_info(post_id, user_id, reply_post_content )
values (1,2,'表示赞同');
insert into reply_post_info(post_id, user_id, reply_post_content )
values (1,2,'表示赞同');
insert into reply_post_info(post_id, user_id, reply_post_content )
values (1,2,'表示赞同');
insert into reply_post_info(post_id, user_id, reply_post_content )
values (1,2,'表示赞同');
insert into reply_post_info(post_id, user_id, reply_post_content )
values (1,2,'表示赞同');
# 回复信息
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (2,1,1,'是的，战狼很好看');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (2,1,1,'是的，战狼很好看');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (2,1,1,'是的，战狼很好看');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (2,1,1,'是的，战狼很好看');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (2,1,1,'是的，战狼很好看');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (2,1,1,'是的，战狼很好看');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (2,1,1,'是的，战狼很好看');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (2,1,1,'是的，战狼很好看');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (2,1,1,'是的，战狼很好看');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (2,1,1,'是的，战狼很好看');
# ```











# ```mysql
#账号
insert into nf_user(user_id,user_phone, user_email, user_name, user_img_url, user_pwd, status, admin_id, grade_id, vip_id, user_coin, user_exp) values (100000,'123456789','123456788@qq.com','会飞的鱼'
,'xxxxxxxx','123456',1,123,2,4,99,190);
insert into nf_user(user_id,user_phone, user_email, user_name, user_img_url, user_pwd, status, admin_id, grade_id, vip_id, user_coin, user_exp) values (100001,'123426789','123426788@qq.com','会飞的鸡'
 ,'xxxxxxxx','123456',1,123,2,4,99,190);
insert into nf_user( user_id,user_phone, user_email, user_name, user_img_url, user_pwd, status, admin_id, grade_id, vip_id, user_coin, user_exp) values (100002,'234256789','234256788@qq.com','会飞的鸭'
 ,'xxxxxxxx','123456',1,123,2,4,99,190);
insert into nf_user( user_id,user_phone, user_email, user_name, user_img_url, user_pwd, status, admin_id, grade_id, vip_id, user_coin, user_exp) values (100003,'234256789','234256788@qq.com','会飞的猪'
 ,'xxxxxxxx','123456',1,123,2,4,99,190);
#帖子信息
insert into post_info( post_id,post_bar_id, post_title, post_content, user_id,  visit_count)
values (1000001,1,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
,100000,2000);
insert into post_info( post_id,post_bar_id, post_title, post_content, user_id,  visit_count)
values (1000002,1,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
       ,100001,2000);
insert into post_info( post_id,post_bar_id, post_title, post_content, user_id,  visit_count)
values (1000003,1,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
       ,100002,2000);
insert into post_info( post_id,post_bar_id, post_title, post_content, user_id,  visit_count)
values (1000004,1,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
       ,100000,2000);
insert into post_info( post_id,post_bar_id, post_title, post_content, user_id,  visit_count)
values (1000005,1,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
       ,100000,2000);
insert into post_info( post_id,post_bar_id, post_title, post_content, user_id,  visit_count)
values (1000006,1,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈。'
       ,100000,2000);
insert into post_info( post_id,post_bar_id, post_title, post_content, user_id,  visit_count)
values (1000007,1,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈1。'
       ,100001,2000);
insert into post_info( post_id,post_bar_id, post_title, post_content, user_id,  visit_count)
values (1000008,1,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈2。'
       ,100002,2000);
insert into post_info( post_id,post_bar_id, post_title, post_content, user_id,  visit_count)
values (1000009,1,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈3。'
       ,100000,2000);
insert into post_info( post_id,post_bar_id, post_title, post_content, user_id,  visit_count)
values (1000010,1,'关于战狼2我突然有感而发，同时也期待战狼3的上映','说京哥要请一个流量明星，但是他要求的片酬太高。我想说的是！！！！！！幸亏他*的没请他来，我擦，不然这个片子肯定不会有这么高流量。是不是很多人和我一样的想法，这个人，不说大家都知道，想想当时演的jixiantegong3，亏我还去的影院，太**了，票房下跌估计全因为他，无力吐槽啊，希望今年战狼3不要换人就好，哈哈哈4。'
       ,100000,2000);
#回帖信息
insert into reply_post_info(reply_post_id,post_id, user_id, reply_post_content )
values (100000,1000001,100002,'表示赞同1');
insert into reply_post_info(reply_post_id,post_id, user_id, reply_post_content )
values (100001,1000002,100002,'表示赞同2');
insert into reply_post_info(reply_post_id,post_id, user_id, reply_post_content )
values (100002,1000003,100002,'表示赞同3');
insert into reply_post_info(reply_post_id,post_id, user_id, reply_post_content )
values (100003,1000001,100003,'表示赞同4');
insert into reply_post_info(reply_post_id,post_id, user_id, reply_post_content )
values (100004,1000001,100000,'表示赞同5');
insert into reply_post_info(reply_post_id,post_id, user_id, reply_post_content )
values (100005,1000001,100003,'表示赞同6');
insert into reply_post_info(reply_post_id,post_id, user_id, reply_post_content )
values (100006,1000001,100002,'表示赞同7');
insert into reply_post_info(reply_post_id,post_id, user_id, reply_post_content )
values (100007,1000001,100002,'表示赞同8');
insert into reply_post_info(reply_post_id,post_id, user_id, reply_post_content )
values (100008,1000002,100001,'表示赞同9');
insert into reply_post_info(reply_post_id,post_id, user_id, reply_post_content )
values (100009,1000003,10000,'表示赞同10');
#回复信息
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (100002,100002,100000,'是的，战狼很好看1');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (100002,100002,100000,'是的，战狼很好看2');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (100002,100001,100000,'是的，战狼很好看3');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (100000,100002,100000,'是的，战狼很好看4');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (100000,100003,100001,'是的，战狼很好看5');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (100000,100001,100003,'是的，战狼很好看6');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (100001,100001,100002,'是的，战狼很好看7');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (100001,100001,100003,'是的，战狼很好看8');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (100002,100003,100002,'是的，战狼很好看9');
insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES (100003,100001,100001,'是的，战狼很好看10');
# ```


insert into reply_post_info (post_id, user_id, reply_post_content)
                          values (6, 10000,'天道酬勤1');
insert into reply_post_info (post_id, user_id, reply_post_content)
values (6, 10001,'不要用战术的勤奋来掩饰战略上的懒惰');

insert into reply_post_info (post_id, user_id, reply_post_content)
values (6, 10002,'½的瞬间');

insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content) VALUES
(10001, 100, 100010,'aaa');

insert into reply_info(user_id, reply_user_id, reply_post_id, reply_content)
values (100000, 10000,100010,'我回复了人1'),
       (100001,10001,100010,'我回复了人2');