INSERT INTO post_bar_partition(partition_name, partition_status) VALUES ("看电影",1),("追剧狂",1),("小说",1),("游戏",1);

INSERT INTO partition_catalogue(partition_id, catalogue_name,catalogue_explain,catalogue_status)
VALUE (1,"香港电影","分区说明",1),(1,"内地电影","分区说明",1),(1,"欧美电影","分区说明",1),(1,"韩国电影","分区说明",1),(1,"日本电影","分区说明",1),(1,"台湾电影","分区说明",1),
  (2,"香港电视剧","分区说明",1),(2,"内地电视剧","分区说明",1),(2,"日本电视剧","分区说明",1),(2,"美剧","分区说明",1),(2,"韩国电视剧","分区说明",1),(2,"电视剧角色","分区说明",1),
  (3,"修真","分区说明",1),(3,"玄幻","分区说明",1),(3,"武侠","分区说明",1),(3,"仙侠","分区说明",1),(3,"科幻","分区说明",1),(3,"历史","分区说明",1),
  (4,"客户端网游","分区说明",1),(4,"桌游","分区说明",1),(4,"网页版游戏","分区说明",1),(4,"小游戏","分区说明",1),(4,"单机游戏","分区说明",1),(4,"电子竞技及选手","分区说明",1);
